[Killed] IncrementInteger
Services/AuthService.php:23:7
 
       return redirect()->to(route('cms.groups.index'));
     } catch (Throwable $th) {
-      return redirect()->back()->with('response', cms_response($th->getMessage(), false, 400));
+      return redirect()->back()->with('response', cms_response($th->getMessage(), false, 401));
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
statusReason: 1) Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 400

[Killed] FalseValue
Services/AuthService.php:23:7
 
       return redirect()->to(route('cms.groups.index'));
     } catch (Throwable $th) {
-      return redirect()->back()->with('response', cms_response($th->getMessage(), false, 400));
+      return redirect()->back()->with('response', cms_response($th->getMessage(), true, 400));
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
statusReason: 1) Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     'data' => Array ()
     'http_status' => 400
     'msg' => 'A senha está incorreta.'

[Killed] Throw_
Services/AuthService.php:30:7
   private function isUserAlreadyLogged()
   {
     if (auth()->check()) {
-      throw new Exception(__('auth.error.already_logged'));
+      new Exception(__('auth.error.already_logged'));
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_receives_an_error_message_if_already_logged
statusReason: 1) Tests\Feature\AuthTest::a_user_receives_an_error_message_if_already_logged
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400

[Killed] LogicalNot
Services/AuthService.php:36:5
 
   private function isPasswordCorrect($user_password, $typed_password)
   {
-    if (!Hash::check($typed_password, $user_password)) {
+    if (Hash::check($typed_password, $user_password)) {
       throw new Exception(__('auth.error.wrong_password'));
     }
killedBy: Tests\Feature\AuthTest::a_user_can_login
statusReason: 1) Tests\Feature\AuthTest::a_user_can_login
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'http://localhost/cms/groups'
+'http://localhost'

[Killed] Throw_
Services/AuthService.php:37:7
   private function isPasswordCorrect($user_password, $typed_password)
   {
     if (!Hash::check($typed_password, $user_password)) {
-      throw new Exception(__('auth.error.wrong_password'));
+      new Exception(__('auth.error.wrong_password'));
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
statusReason: 1) Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/AuthTest.php:48

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.
