[Killed] FunctionCall
Services/CmsUserService.php:18:5
     $data['usu_password'] = Hash::make($data['usu_password']);
     User::create($data);
 
-    return cms_response(__('user.success.create'));
+    cms_response(__('user.success.create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\UserTest::a_user_can_be_created
statusReason: 1) Tests\Feature\Cms\UserTest::a_user_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UserTest.php:36

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCall
Services/CmsUserService.php:31:7
       $user = $this->__findOrFail($id);
       $user->update($data);
 
-      return cms_response(__('user.success.update'));
+      cms_response(__('user.success.update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\UserTest::a_user_can_be_updated
statusReason: 1) Tests\Feature\Cms\UserTest::a_user_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UserTest.php:62

FAILURES!
Tests: 4, Assertions: 5, Failures: 1.

[Killed] FunctionCall
Services/CmsUserService.php:40:5
   public function delete(string $ids)
   {
     User::whereIn('usu_id', json_decode($ids))->delete();
-    return cms_response(__('user.success.delete'));
+    cms_response(__('user.success.delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\UserTest::users_can_be_excluded
statusReason: 1) Tests\Feature\Cms\UserTest::users_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UserTest.php:114

FAILURES!
Tests: 8, Assertions: 10, Failures: 1.

[Killed] Throw_
Services/CmsUserService.php:49:5
     if ($user instanceof User) {
       return $user;
     }
-    throw new Exception(__('user.error.not_found'));
+    new Exception(__('user.error.not_found'));
   }
 }
killedBy: Tests\Feature\Cms\UserTest::if_the_user_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\UserTest::if_the_user_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
