[Survived] FunctionCall
Http/Controllers/Authentication/AuthController.php:16:5
 
   public function getUserTheLoginView()
   {
-    return view('cms.auth.login');
+    view('cms.auth.login');
+        return null;
   }
 
