[Killed] FunctionCall
Services/EventService.php:15:5
   public function create(array $data)
   {
     Event::create($data);
-    return cms_response(__('event.success.create'));
+    cms_response(__('event.success.create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\EventTest::an_event_can_be_created
statusReason: 1) Tests\Feature\Cms\EventTest::an_event_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:35

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCall
Services/EventService.php:24:7
       $event = $this->__findOrFail($id);
       $event->update($data);
 
-      return cms_response(__('event.success.update'));
+      cms_response(__('event.success.update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\EventTest::an_event_can_be_updated
statusReason: 1) Tests\Feature\Cms\EventTest::an_event_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:73

FAILURES!
Tests: 5, Assertions: 6, Failures: 1.

[Killed] FunctionCall
Services/EventService.php:33:5
   public function delete(string $ids)
   {
     Event::whereIn('eve_id', json_decode($ids))->delete();
-    return cms_response(__('event.success.delete'));
+    cms_response(__('event.success.delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\EventTest::events_can_be_excluded
statusReason: 1) Tests\Feature\Cms\EventTest::events_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:126

FAILURES!
Tests: 9, Assertions: 12, Failures: 1.

[Killed] Throw_
Services/EventService.php:42:5
     if ($event instanceof Event) {
       return $event;
     }
-    throw new Exception(__('event.error.not_found'));
+    new Exception(__('event.error.not_found'));
   }
 }
killedBy: Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
