[Killed] FunctionCall
Services/GroupService.php:23:5
     $group = Group::create($data);
     $group->modules()->attach($modules_id);
 
-    return cms_response(__('group.success.create'));
+    cms_response(__('group.success.create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\GroupsTest::a_group_can_be_created
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_group_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:35

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCall
Services/GroupService.php:36:7
       $group->update($data);
       $group->modules()->sync($modules_ids);
 
-      return cms_response(__('group.success.update'));
+      cms_response(__('group.success.update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:63

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] FunctionCall
Services/GroupService.php:46:5
   public function delete(string $ids)
   {
     Group::whereIn('gro_id', json_decode($ids))->delete();
-    return cms_response(__('group.success.delete'));
+    cms_response(__('group.success.delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\GroupsTest::groups_can_be_excluded
statusReason: 1) Tests\Feature\Cms\GroupsTest::groups_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:103

FAILURES!
Tests: 7, Assertions: 10, Failures: 1.

[Killed] Throw_
Services/GroupService.php:55:5
     if ($group instanceof Group) {
       return $group;
     }
-    throw new Exception(__('group.error.not_found'));
+    new Exception(__('group.error.not_found'));
   }
 }
killedBy: Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
