[Killed] Throw_
Services/AuthService.php:24:7
   public function redirectUserIfAlreadyLoggedIn()
   {
     if (auth()->check()) {
-      throw new Exception('Você já está logado.');
+      new Exception('Você já está logado.');
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_receives_an_error_message_if_already_logged
statusReason: 1) Tests\Feature\AuthTest::a_user_receives_an_error_message_if_already_logged
Failed asserting that null matches expected 'Você já está logado.'.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/AuthTest.php:64

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Services/AuthService.php:30:5
 
   public function redirectUserIfPasswordIsIncorrect()
   {
-    if (!Hash::check($this->data['password'], $this->user->password)) {
+    if (Hash::check($this->data['password'], $this->user->password)) {
       throw new Exception('A senha está incorreta.');
     }
killedBy: Tests\Feature\AuthTest::a_user_can_login
statusReason: 1) Tests\Feature\AuthTest::a_user_can_login
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'http://localhost/cms/groups'
+'http://localhost'

[Killed] Throw_
Services/AuthService.php:31:7
   public function redirectUserIfPasswordIsIncorrect()
   {
     if (!Hash::check($this->data['password'], $this->user->password)) {
-      throw new Exception('A senha está incorreta.');
+      new Exception('A senha está incorreta.');
     }
   }
killedBy: Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
statusReason: 1) Tests\Feature\AuthTest::a_user_cant_login_with_wrong_password
Failed asserting that null matches expected 'A senha está incorreta.'.

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/AuthTest.php:48

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
