[Killed] FunctionCall
Services/TicketService.php:15:5
   public function create(array $data)
   {
     Ticket::create($data);
-    return cms_response(__('ticket.success.create'));
+    cms_response(__('ticket.success.create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\TicketTest::a_ticket_can_be_created
statusReason: 1) Tests\Feature\Cms\TicketTest::a_ticket_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/TicketTest.php:34

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] FunctionCall
Services/TicketService.php:23:7
     try {
       $ticket = $this->__findOrFail($id);
       $ticket->update($data);
-      return cms_response(__('ticket.success.update'));
+      cms_response(__('ticket.success.update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\TicketTest::a_ticket_can_be_updated
statusReason: 1) Tests\Feature\Cms\TicketTest::a_ticket_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/TicketTest.php:59

FAILURES!
Tests: 4, Assertions: 4, Failures: 1.

[Killed] FunctionCall
Services/TicketService.php:32:5
   public function delete(string $ids)
   {
     Ticket::whereIn('tic_id', json_decode($ids))->delete();
-    return cms_response(__('ticket.success.delete'));
+    cms_response(__('ticket.success.delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\TicketTest::multiple_tickets_can_be_deleted
statusReason: 1) Tests\Feature\Cms\TicketTest::multiple_tickets_can_be_deleted
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/TicketTest.php:98

FAILURES!
Tests: 7, Assertions: 8, Failures: 1.

[Killed] InstanceOf_
Services/TicketService.php:38:5
   private function __findOrFail(int $id)
   {
     $event = Ticket::find($id);
-    if ($event instanceof Ticket) {
+    if (true) {
       return $event;
     }
killedBy: Tests\Feature\Cms\TicketTest::when_updating_a_ticket_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\TicketTest::when_updating_a_ticket_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400

[Killed] InstanceOf_
Services/TicketService.php:38:5
   private function __findOrFail(int $id)
   {
     $event = Ticket::find($id);
-    if ($event instanceof Ticket) {
+    if (false) {
       return $event;
     }
killedBy: Tests\Feature\Cms\TicketTest::a_ticket_can_be_updated
statusReason: 1) Tests\Feature\Cms\TicketTest::a_ticket_can_be_updated
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 200

[Killed] Throw_
Services/TicketService.php:41:5
     if ($event instanceof Ticket) {
       return $event;
     }
-    throw new Exception(__('ticket.error.not_found'));
+    new Exception(__('ticket.error.not_found'));
   }
 }
killedBy: Tests\Feature\Cms\TicketTest::when_updating_a_ticket_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\TicketTest::when_updating_a_ticket_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
