[Killed] FunctionCall
Http/Controllers/Cms/GroupController.php:28:5
   {
     $groups = $this->service->listAll();
 
-    return view('cms.groups.index', compact('groups'));
+    view('cms.groups.index', compact('groups'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\GroupsTest::a_user_can_see_the_listing_of_groups
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_user_can_see_the_listing_of_groups
Failed asserting that '' contains "suscipit".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:531
/var/www/html/tests/Feature/Cms/GroupsTest.php:33

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
