[Killed] FunctionCall
Services/CmsUserService.php:18:5
     $data['password'] = Hash::make($data['password']);
     User::create($data);
 
-    return cms_response(trans('cms.users.success_create'));
+    cms_response(trans('cms.users.success_create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\UsersTest::a_user_can_be_created
statusReason: 1) Tests\Feature\Cms\UsersTest::a_user_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UsersTest.php:43

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCall
Services/CmsUserService.php:31:7
       $user = $this->__findOrFail($id);
       $user->update($data);
 
-      return cms_response(trans('cms.users.success_update'));
+      cms_response(trans('cms.users.success_update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\UsersTest::a_user_can_be_updated
statusReason: 1) Tests\Feature\Cms\UsersTest::a_user_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UsersTest.php:82

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Services/CmsUserService.php:33:7
 
       return cms_response(trans('cms.users.success_update'));
     } catch (\Throwable $th) {
-      return cms_response($th->getMessage(), false, 400);
+      return cms_response($th->getMessage(), false, 401);
     }
   }
killedBy: Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 400

[Killed] FalseValue
Services/CmsUserService.php:33:7
 
       return cms_response(trans('cms.users.success_update'));
     } catch (\Throwable $th) {
-      return cms_response($th->getMessage(), false, 400);
+      return cms_response($th->getMessage(), true, 400);
     }
   }
killedBy: Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
     'data' => Array ()
     'http_status' => 400
     'msg' => 'cms.users.error_user_not_found'

[Killed] FunctionCall
Services/CmsUserService.php:40:5
   public function delete(string $ids)
   {
     User::whereIn('id', json_decode($ids))->delete();
-    return cms_response(trans('cms.users.success_delete'));
+    cms_response(trans('cms.users.success_delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\UsersTest::users_can_be_excluded
statusReason: 1) Tests\Feature\Cms\UsersTest::users_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/UsersTest.php:151

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] InstanceOf_
Services/CmsUserService.php:46:5
   private function __findOrFail(int $id)
   {
     $user = User::find($id);
-    if ($user instanceof User) {
+    if (false) {
       return $user;
     }
killedBy: Tests\Feature\Cms\UsersTest::a_user_can_be_updated
statusReason: 1) Tests\Feature\Cms\UsersTest::a_user_can_be_updated
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 200

[Killed] InstanceOf_
Services/CmsUserService.php:46:5
   private function __findOrFail(int $id)
   {
     $user = User::find($id);
-    if ($user instanceof User) {
+    if (true) {
       return $user;
     }
killedBy: Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400

[Killed] Throw_
Services/CmsUserService.php:49:5
     if ($user instanceof User) {
       return $user;
     }
-    throw new Exception(trans('cms.users.error_user_not_found'));
+    new Exception(trans('cms.users.error_user_not_found'));
   }
 }
killedBy: Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\UsersTest::if_the_user_isnt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
