[Killed] FunctionCall
Services/EventService.php:15:5
   public function create(array $data)
   {
     Event::create($data);
-    return cms_response(trans('cms.events.success_create'));
+    cms_response(trans('cms.events.success_create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\EventTest::an_event_can_be_created
statusReason: 1) Tests\Feature\Cms\EventTest::an_event_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:39

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCall
Services/EventService.php:24:7
       $event = $this->__findOrFail($id);
       $event->update($data);
 
-      return cms_response(trans('cms.events.success_update'));
+      cms_response(trans('cms.events.success_update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\EventTest::an_event_can_be_updated
statusReason: 1) Tests\Feature\Cms\EventTest::an_event_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:92

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Services/EventService.php:26:7
 
       return cms_response(trans('cms.events.success_update'));
     } catch (\Throwable $th) {
-      return cms_response($th->getMessage(), false, 400);
+      return cms_response($th->getMessage(), false, 399);
     }
   }
killedBy: Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 400

[Killed] FunctionCall
Services/EventService.php:33:5
   public function delete(string $ids)
   {
     Event::whereIn('id', json_decode($ids))->delete();
-    return cms_response(trans('cms.events.success_delete'));
+    cms_response(trans('cms.events.success_delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\EventTest::events_can_be_excluded
statusReason: 1) Tests\Feature\Cms\EventTest::events_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/EventTest.php:141

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] InstanceOf_
Services/EventService.php:39:5
   private function __findOrFail(int $id)
   {
     $event = Event::find($id);
-    if ($event instanceof Event) {
+    if (true) {
       return $event;
     }
killedBy: Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400

[Killed] InstanceOf_
Services/EventService.php:39:5
   private function __findOrFail(int $id)
   {
     $event = Event::find($id);
-    if ($event instanceof Event) {
+    if (false) {
       return $event;
     }
killedBy: Tests\Feature\Cms\EventTest::an_event_can_be_updated
statusReason: 1) Tests\Feature\Cms\EventTest::an_event_can_be_updated
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 200

[Killed] Throw_
Services/EventService.php:42:5
     if ($event instanceof Event) {
       return $event;
     }
-    throw new Exception(trans('cms.events.error_not_found'));
+    new Exception(trans('cms.events.error_not_found'));
   }
 }
killedBy: Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\EventTest::when_updating_an_event_if_not_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
