[Killed] FunctionCall
Services/GroupService.php:23:5
     $group = Group::create($data);
     $group->modules()->attach($modules_id);
 
-    return cms_response(trans('cms.groups.success_create'));
+    cms_response(trans('cms.groups.success_create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\GroupsTest::a_group_can_be_created
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_group_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:49

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCall
Services/GroupService.php:36:7
       $group->update($data);
       $group->modules()->sync($modules_ids);
 
-      return cms_response(trans('cms.groups.success_update'));
+      cms_response(trans('cms.groups.success_update'));
+            return null;
     } catch (\Throwable $th) {
       return cms_response($th->getMessage(), false, 400);
killedBy: Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:84

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCall
Services/GroupService.php:46:5
   public function delete(string $ids)
   {
     Group::whereIn('id', json_decode($ids))->delete();
-    return cms_response(trans('cms.groups.success_delete'));
+    cms_response(trans('cms.groups.success_delete'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\GroupsTest::groups_can_be_excluded
statusReason: 1) Tests\Feature\Cms\GroupsTest::groups_can_be_excluded
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/GroupsTest.php:131

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] InstanceOf_
Services/GroupService.php:52:5
   private function __findOrFail(int $id)
   {
     $group = Group::find($id);
-    if ($group instanceof Group) {
+    if (true) {
       return $group;
     }
killedBy: Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_snt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_snt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400

[Killed] InstanceOf_
Services/GroupService.php:52:5
   private function __findOrFail(int $id)
   {
     $group = Group::find($id);
-    if ($group instanceof Group) {
+    if (false) {
       return $group;
     }
killedBy: Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
statusReason: 1) Tests\Feature\Cms\GroupsTest::a_group_can_be_updated
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
-    'http_status' => 200

[Killed] Throw_
Services/GroupService.php:55:5
     if ($group instanceof Group) {
       return $group;
     }
-    throw new Exception(trans('cms.groups.error_not_found'));
+    new Exception(trans('cms.groups.error_not_found'));
   }
 }
killedBy: Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_snt_found_an_error_is_returned
statusReason: 1) Tests\Feature\Cms\GroupsTest::when_updating_a_group_if_it_snt_found_an_error_is_returned
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
     'data' => Array ()
     'http_status' => 400
