[Killed] FunctionCall
Services/TicketService.php:15:5
   public function create(array $data)
   {
     Ticket::create($data);
-    return cms_response(trans('cms.ticket.success_create'));
+    cms_response(trans('cms.ticket.success_create'));
+        return null;
   }
 
killedBy: Tests\Feature\Cms\TicketTest::a_ticket_can_be_created
statusReason: 1) Tests\Feature\Cms\TicketTest::a_ticket_can_be_created
null does not match expected type "array".

/var/www/html/vendor/laravel/framework/src/Illuminate/Testing/TestResponse.php:1183
/var/www/html/tests/Feature/Cms/TicketTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
